IDENTIFICATION DIVISION.
PROGRAM-ID. TUITION.
AUTHOR. MICHAEL BRUNS.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT IN-STUDENT-FILE ASSIGN TO 'prg1.dat'
ORGANIZATION IS LINE SEQUENTIAL.
SELECT OUT-STUDENT-FILE ASSIGN TO 'prg1-bruns.rpt'
ORGANIZATION IS LINE SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD IN-STUDENT-FILE.
01     IN-STUDENT-REC.
        05 STUDNAME-IN PIC X(20).
        05 NUMCRED-IN PIC 99.
        05 PIC X(58).
FD OUT-STUDENT-FILE.
01	OUT-STUDENT-REC.
	05 STUDNAME-OUT PIC X(20).
	05 PIC X(20).
	05 NUMCRED-OUT PIC 99.
	05 PIC X(20).
	05 TUITION-OUT PIC 9(4).	
WORKING-STORAGE SECTION.
01 TUITION PIC 9(4).
01 EOF PIC X.
PROCEDURE DIVISION.
100-MAIN.
   OPEN INPUT IN-STUDENT-FILE
   	OUTPUT OUT-STUDENT-FILE
      PERFORM UNTIL EOF = 'Y'
         READ IN-STUDENT-FILE
            AT END 
		MOVE 'Y' TO EOF
            NOT AT END
                PERFORM 200-PROCESS-RTN  
         END-READ
      END-PERFORM
   CLOSE IN-STUDENT-FILE
   	OUT-STUDENT-FILE
STOP RUN.

200-PROCESS-RTN.
	MOVE STUDNAME-IN TO STUDNAME-OUT
	MOVE NUMCRED-IN TO NUMCRED-OUT
	IF NUMCRED-IN < 12 THEN
                     MULTIPLY NUMCRED-IN BY 525 GIVING TUITION
                  ELSE
                     SET TUITION TO 6300
                  END-IF
	MOVE TUITION TO TUITION-OUT
	DISPLAY OUT-STUDENT-REC
	WRITE OUT-STUDENT-REC.
